//
//  DataManager.swift
//  HW28CitiesV1
//
//  Created by Dmitrii Onegin on 07.01.2022.
//

import Foundation

class DataManager {
    
    static let shared = DataManager()
    
    let cityNames = ["Санкт-Петербург","Москва","Тюмень","Уфа","Новосибирск"]
    let userNames = ["Дмитрий Онегин","Владислав","Артем","Динар","Дмитрий"]
    let population = ["1","2","3","4","5"]
    let area = ["10","20","30","40","50"]
    let foundedDate = ["100","200","300","400","500"]
    let sights = [
        // Места Санкт-Петербург
        [
            ["место категории театр",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории спорт",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории архитектура",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории еда",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории парки",
             "адрес",
             "город",
             "рейтинг",
             "описание"]
        ],
        // Места Москва
        [
            ["место категории театр",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории спорт",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории архитектура",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории еда",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории парки",
             "адрес",
             "город",
             "рейтинг",
             "описание"]
        ],
        // Места Тюмень
        [
            ["место категории театр",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории спорт",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории архитектура",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории еда",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории парки",
             "адрес",
             "город",
             "рейтинг",
             "описание"]
        ],
        // Места Уфа
        [
            ["место категории театр",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории спорт",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории архитектура",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории еда",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории парки",
             "адрес",
             "город",
             "рейтинг",
             "описание"]
        ],
        // Места Новосибирск
        [
            ["место категории театр",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории спорт",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории архитектура",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории еда",
             "адрес",
             "город",
             "рейтинг",
             "описание"],
            ["место категории парки",
             "адрес",
             "город",
             "рейтинг",
             "описание"]
        ]
    ]
    
    private init() {}
}
